#+TITLE: Emacs Pro-tips
#+URL: https://ambrevar.xyz/emacs/index.html
#+AUTHOR: lujun9972
#+TAGS: raw
#+DATE: [2018年 10月 23日 星期二 10:12:34 HKT]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil


Emacs is a wild beast that takes a while to tame. Read upon the official
documentation, learn Elisp, check out for the best third-party packages and
learn from other users.

Here follows a selection of subtle best practices on how to set up Emacs as well
as a selection of my favorite Emacs features. See my [[https://gitlab.com/ambrevar/dotfiles][dotfiles]] for my complete
configuration.

Also see the [[../emacs2/index.html][follow-up article]].

** Org Mode
   :PROPERTIES:
   :CUSTOM_ID: org7966e81
   :END:

Last but not least, the famous [[http://orgmode.org/][Org Mode]]. It offers some impressive features,
such as seamless table manipulation (swap columns with a keystroke...) and formula
computation. From the manual:

#+BEGIN_EXAMPLE
    Finally, just to whet your appetite for what can be done with the
    fantastic `calc.el' package, here is a table that computes the Taylor
    series of degree `n' at location `x' for a couple of functions.

     |---+-------------+---+-----+--------------------------------------|
     | | Func | n | x | Result |
     |---+-------------+---+-----+--------------------------------------|
     | # | exp(x) | 1 | x | 1 + x |
     | # | exp(x) | 2 | x | 1 + x + x^2 / 2 |
     | # | exp(x) | 3 | x | 1 + x + x^2 / 2 + x^3 / 6 |
     | # | x^2+sqrt(x) | 2 | x=0 | x*(0.5 / 0) + x^2 (2 - 0.25 / 0) / 2 |
     | # | x^2+sqrt(x) | 2 | x=1 | 2 + 2.5 x - 2.5 + 0.875 (x - 1)^2 |
     | 0_sync_master.sh 1_add_new_article_manual.sh 1_add_new_article_newspaper.sh 2_start_translating.sh 3_continue_the_work.sh 4_finish.sh 5_pause.sh base.sh parse_url_by_manual.sh parse_url_by_newspaper.py parse_url_by_newspaper.sh project.cfg reformat.sh texput.log urls_checker.sh | tan(x) | 3 | x | 0.0175 x + 1.77e-6 x^3 |
     |---+-------------+---+-----+--------------------------------------|
     #+TBLFM: $5=taylor($2,$4,$3);n3
#+END_EXAMPLE

Note that the last column is computed automatically! Formulae can be computed
using the Calc mode, Elisp, or even external programs such as R or PARI/GP.
Possibilities are endless.

Finally, you can export the end result to LaTeX, HTML, etc.

